package Others;

public class JavaForBegginersLesson4 {
    public static void main(String[] args) {
        boolean t = 5 == 5; // мы проверяем равно ли 5 = 5, именно совершаем проверку через два знака ==,
        // потому что один знак равно уже зарезервирован для операции присваевания, когда два знака ==
        // определяют операцию присваивания.
        // Значение переменной в данном случае будет true, если же указать что 5<5 то значение будет false.

        int value = 0;
//        boolean t = value>5;
//        System.out.println(t); // в данном случае мы имеет false, так как value = 0 не может быть больше пяти.
        // Если же мы поменяем значение value на 7, то получим true.
        // цикл WhileLoops это тот цикл который выполняется пока/до тех пор какое либо условие дает нам True

        // синтаксис цикла WhileLoops

//        int value = 10;
//        while (value>5){       // в фигурных скобках указываем тело цикла, инструкции которые будут выполнятся.
//            System.out.println("Hello"+value);
//            value = value+1; //цикл прокрутится до 5 раз
        // while пишется с маленькой буквы, как и все операторы в Java


    }

}

