package Codewars;

public class kata62 {
    public static void main(String[] args) {
        System.out.println(sum(new int[] { 6, 2, 1, 8, 10}));
    }
       // Массив чисел.
       // Работа с List<>;
       // Нужно суммиоровать все значения массива, кроме самого высокого и самого низкого элемента (по значению, а не по индеквсу)
       // Проверка ввода, если сместо массива задано пустое значение (null, none, nothing и т.д.) или массив является пустым список,
       // или список состоящим только из 1 элемента, возвращаем 0.

       // План
       // Сортируем массив.
       // Инициализируем list><;


    public static int sum(int[] numbers) {


        return 0;
    }
}
